[{"data":1,"prerenderedAt":345},["Reactive",2],{"/blog/2022-in-review":3,"prev-next":340},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"image":10,"alt":11,"postDate":12,"tags":13,"body":16,"_type":335,"_id":336,"_source":337,"_file":338,"_extension":339},"/blog/2022-in-review","blog",false,"","Looking back: My 2022 in review","From new adventures and memories to lessons learned and personal growth, this year has been a year of discovery. Here's my 2022 in review.","/images/2022-in-review/looking-back.png","My 2022 in review","2022-12-31T00:00:00.000Z",[14,15],"personal","travel",{"type":17,"children":18,"toc":327},"root",[19,27,32,37,44,49,56,61,66,87,92,97,102,120,126,131,136,152,157,171,177,182,187,192,197,202,207,213,218,223,229,234,240,254,259,265,270,276,307,312,317,322],{"type":20,"tag":21,"props":22,"children":23},"element","p",{},[24],{"type":25,"value":26},"text","As the earth completes another revolution around the sun and yet another year comes to an end, I can't help but look back and reflect on all that has happened.",{"type":20,"tag":21,"props":28,"children":29},{},[30],{"type":25,"value":31},"For me, this year has been filled with highs and lows, moments of joy and sorrow, and a range of emotions in between. From embarking on solo adventures to creating lasting memories with close friends, I've had the opportunity to learn and grow in ways I never could have imagined.",{"type":20,"tag":21,"props":33,"children":34},{},[35],{"type":25,"value":36},"Join me as I take a journey through the year that was, and discover the lessons and insights I've gained along the way.",{"type":20,"tag":38,"props":39,"children":41},"h1",{"id":40},"personal-highlights",[42],{"type":25,"value":43},"Personal highlights",{"type":20,"tag":21,"props":45,"children":46},{},[47],{"type":25,"value":48},"This year has been filled with exciting adventures, personal growth, and lasting memories. Here are some of the highlights:",{"type":20,"tag":50,"props":51,"children":53},"h2",{"id":52},"a-year-of-travel-my-adventures-in-10-countries",[54],{"type":25,"value":55},"A Year of Travel: My Adventures in 10 Countries",{"type":20,"tag":21,"props":57,"children":58},{},[59],{"type":25,"value":60},"This year, I set off on a series of solo adventures that opened my eyes to new experiences and gave me the freedom to make spontaneous decisions. As I traveled to different countries and immersed myself in diverse cultures, I gained a new perspective on the world and my place in it.",{"type":20,"tag":21,"props":62,"children":63},{},[64],{"type":25,"value":65},"Along the way, I met a cast of intriguing characters and took time to reflect on my life and future goals. And when I wasn't venturing out on my own, I made some unforgettable memories with my closest friends.",{"type":20,"tag":67,"props":68,"children":71},"figure",{"className":69},[70],"image",[72,74,80,81],{"type":25,"value":73},"\n  ",{"type":20,"tag":75,"props":76,"children":79},"img",{"src":77,"alt":78},"/images/2022-in-review/europe-map-visited.svg","Europe map",[],{"type":25,"value":73},{"type":20,"tag":82,"props":83,"children":84},"figcaption",{},[85],{"type":25,"value":86},"A map of Europe with the countries I traveled to in 2022 marked in blue",{"type":20,"tag":21,"props":88,"children":89},{},[90],{"type":25,"value":91},"I embarked on a journey that took me to 10 countries, 8 of which were new to me. From the beautiful beaches of Greece and the breathtaking landscapes of Norway, to the charming streets of Belgium and the historic sites of Poland, I was constantly in awe of the diverse cultures and landscapes I encountered. In Italy, I marveled at the stunning architecture and savored the delicious cuisine. I also visited the smallest country in the world, Vatican City and marveled at the beauty of St. Peter's Basilica. In Estonia, I was struck by the country's natural beauty and rich history, and in Finland, I was fascinated by the unique blend of modern and traditional culture.",{"type":20,"tag":21,"props":93,"children":94},{},[95],{"type":25,"value":96},"And even though I've visited Switzerland and Austria before, I always find something new and exciting to discover in these beautiful countries. Along the way, I also explored countless charming towns and villages throughout Germany.",{"type":20,"tag":21,"props":98,"children":99},{},[100],{"type":25,"value":101},"All these experiences made this year one of the most memorable and rewarding travel experiences of my life.",{"type":20,"tag":67,"props":103,"children":106},{"className":104},[105],"quote",[107,108,114,115],{"type":25,"value":73},{"type":20,"tag":109,"props":110,"children":111},"blockquote",{},[112],{"type":25,"value":113},"\n    The use of traveling is to regulate imagination by reality, and instead of thinking how things may be, to see them as they are.\n  ",{"type":25,"value":73},{"type":20,"tag":82,"props":116,"children":117},{},[118],{"type":25,"value":119},"\n    — Samuel Johnson\n  ",{"type":20,"tag":50,"props":121,"children":123},{"id":122},"finding-my-inner-strength-my-50kmday-hikes-in-germany",[124],{"type":25,"value":125},"Finding My Inner Strength: My 50km/day hikes in Germany",{"type":20,"tag":21,"props":127,"children":128},{},[129],{"type":25,"value":130},"This year, I pushed myself to new limits with two epic 50km/day hikes that challenged my physical and mental strength. As someone who has not traditionally considered themselves an athlete, this was a significant accomplishment that I never would have thought myself capable of before.",{"type":20,"tag":21,"props":132,"children":133},{},[134],{"type":25,"value":135},"The first one was along the Rössleweg in Stuttgart, Germany. It is mostly through wooded areas, picturesque vineyards and orchards, all while overlooking the valley known as the Stuttgarter Kessel.",{"type":20,"tag":21,"props":137,"children":138},{},[139,141,150],{"type":25,"value":140},"It was in preparation for the second one, which was the ",{"type":20,"tag":142,"props":143,"children":147},"a",{"href":144,"rel":145},"https://www.megamarsch.de/50-12/freiburg/freiburg-anmeldung/",[146],"nofollow",[148],{"type":25,"value":149},"50 km MegaMarsch event in Freiburg",{"type":25,"value":151},", Germany. This was a 50km hike that started in the city and through the Black Forest, which is known for its dense forests and steep hills, before finally ending back in the city.",{"type":20,"tag":21,"props":153,"children":154},{},[155],{"type":25,"value":156},"Despite the exhausting nature of these hikes, they were both amazing experiences that helped me to push myself and discover what I was capable of.",{"type":20,"tag":21,"props":158,"children":159},{},[160,162,169],{"type":25,"value":161},"I am grateful to my good friend ",{"type":20,"tag":142,"props":163,"children":166},{"href":164,"rel":165},"https://www.instagram.com/carsten_thm/",[146],[167],{"type":25,"value":168},"Carsten Cierniak",{"type":25,"value":170}," for introducing me to the MegaMarsch event and for providing motivation and companionship during the hikes. Thanks also to him for the guidance and tips that helped me prepare for the hikes.",{"type":20,"tag":50,"props":172,"children":174},{"id":173},"the-great-outdoors-a-year-of-hiking-and-exploring",[175],{"type":25,"value":176},"The Great Outdoors: A Year of Hiking and Exploring",{"type":20,"tag":21,"props":178,"children":179},{},[180],{"type":25,"value":181},"Throughout the year, I have been able to do a lot of hiking, ranging from short walks to full-day hikes. Each trail offered its own unique beauty and challenges, from scenic mountain vistas to dense forests and winding rivers.",{"type":20,"tag":21,"props":183,"children":184},{},[185],{"type":25,"value":186},"Hiking has allowed me to disconnect from the stresses of daily life and reconnect with the beauty of the natural world. It has also been a great way to stay active and healthy, both physically and mentally.",{"type":20,"tag":21,"props":188,"children":189},{},[190],{"type":25,"value":191},"The most memorable hikes of the year were: to Zugspitze 🇩🇪, in the Black Forest 🇩🇪, in the Saxon Switzerland National Park 🇩🇪, and in Sognsvann 🇳🇴.",{"type":20,"tag":21,"props":193,"children":194},{},[195],{"type":25,"value":196},"Climbing to the top of Zugspitze, the highest mountain in Germany, proved to be a formidable challenge.The steep and rocky path halfway up the mountain was difficult, and the weather near the top was bad enough that we had to stop just a few hundred meters from the summit. However, the stunning views along the way and the feeling of accomplishment made it all worth it.",{"type":20,"tag":21,"props":198,"children":199},{},[200],{"type":25,"value":201},"I was able to build a strong connection with my friends who accompanied me during these hikes as we bonded over the shared experience of exploring the beautiful nature these regions have to offer.",{"type":20,"tag":21,"props":203,"children":204},{},[205],{"type":25,"value":206},"Hiking has become a passion of mine and I look forward to continuing to explore the many trails that the world has to offer.",{"type":20,"tag":50,"props":208,"children":210},{"id":209},"a-night-to-remember-iron-maiden-in-concert",[211],{"type":25,"value":212},"A Night to Remember: Iron Maiden in Concert",{"type":20,"tag":21,"props":214,"children":215},{},[216],{"type":25,"value":217},"I was able to realize a long time desire of mine this year by seeing one of my favorite bands Iron Maiden live in concert. The thrill of hearing the songs I love performed live was an incredible. Despite the age of the band members, they delivered an electric performance and were able to make the 50,000 people present in the venue chant in unison.",{"type":20,"tag":21,"props":219,"children":220},{},[221],{"type":25,"value":222},"It was an unforgettable event that I will always cherish.",{"type":20,"tag":38,"props":224,"children":226},{"id":225},"professional-highlights",[227],{"type":25,"value":228},"Professional highlights",{"type":20,"tag":21,"props":230,"children":231},{},[232],{"type":25,"value":233},"In addition to my travels, hikes and fun events, this year has also brought its share of challenges and growth in my professional life.",{"type":20,"tag":50,"props":235,"children":237},{"id":236},"stepping-into-a-new-role-overcoming-challenges-and-finding-success",[238],{"type":25,"value":239},"Stepping into a new role: Overcoming Challenges and Finding Success",{"type":20,"tag":21,"props":241,"children":242},{},[243,245,252],{"type":25,"value":244},"As a seasoned Software Engineer with almost a decade of experience under my belt, I thought I had seen it all. But when I accepted the role of Software Engineering Team Lead at ",{"type":20,"tag":142,"props":246,"children":249},{"href":247,"rel":248},"https://laserhub.com/",[146],[250],{"type":25,"value":251},"Laserhub GmbH",{"type":25,"value":253},", I quickly realized that I had a lot to learn. Not only was this a promotion, but it also required me to approach things in a new way and shed some of my old habits.",{"type":20,"tag":21,"props":255,"children":256},{},[257],{"type":25,"value":258},"I'd be lying if I said it has been easy. There have been a lot of challenges, but I've been enjoying it so far and learning to see things from a new perspective. With the help of the wonderful people I work with, I have been able to grow a lot in this role.",{"type":20,"tag":38,"props":260,"children":262},{"id":261},"resilience-in-adversity-struggles-of-those-close-to-me-in-2022",[263],{"type":25,"value":264},"Resilience in Adversity: Struggles of Those Close to Me in 2022",{"type":20,"tag":21,"props":266,"children":267},{},[268],{"type":25,"value":269},"In February of this year, a war broke out in Ukraine, causing me great concern for the safety of my colleagues and their loved ones living there. Despite my fears, they are fortunately able to remain safe, but they still have to cope with the ongoing effects of the war. I am in awe of their strength and resilience as they continue to live their lives as normally as possible, despite the challenges they face. I can only hope that the situation will improve and that peace will be restored in the near future.",{"type":20,"tag":38,"props":271,"children":273},{"id":272},"personal-key-takeaways-from-2022",[274],{"type":25,"value":275},"Personal key takeaways from 2022",{"type":20,"tag":277,"props":278,"children":281},"ul",{"className":279},[280],"list",[282,283,289,290,295,296,301,302],{"type":25,"value":73},{"type":20,"tag":284,"props":285,"children":286},"li",{},[287],{"type":25,"value":288},"We are all works in progress. Who we were yesterday is not who we are today, and who we are today is not who we will be tomorrow.",{"type":25,"value":73},{"type":20,"tag":284,"props":291,"children":292},{},[293],{"type":25,"value":294},"There is always the potential for growth and learning, and we should always be open to new knowledge and opportunities for self-improvement.",{"type":25,"value":73},{"type":20,"tag":284,"props":297,"children":298},{},[299],{"type":25,"value":300},"Embracing challenges is essential to personal growth and development.",{"type":25,"value":73},{"type":20,"tag":284,"props":303,"children":304},{},[305],{"type":25,"value":306},"Investing in meaningful relationships with loved ones is always worthwhile.",{"type":20,"tag":21,"props":308,"children":309},{},[310],{"type":25,"value":311},"As I look back on the year that was, I am filled with gratitude for all the things I've learned and experienced.",{"type":20,"tag":21,"props":313,"children":314},{},[315],{"type":25,"value":316},"Unfortunately, not everyone has had the same experience, with some really horrible things that happened in the world. I hope that 2023 will be a better year for everyone.",{"type":20,"tag":21,"props":318,"children":319},{},[320],{"type":25,"value":321},"I am grateful for the support and encouragement of those in my life this year. Your guidance and opportunities have allowed me to grow. Thank you for being a part of my journey and for the amazing times we had together.",{"type":20,"tag":21,"props":323,"children":324},{},[325],{"type":25,"value":326},"Here's to the future and to the continued growth and learning that it holds.",{"title":7,"searchDepth":328,"depth":328,"links":329},2,[330,331,332,333,334],{"id":52,"depth":328,"text":55},{"id":122,"depth":328,"text":125},{"id":173,"depth":328,"text":176},{"id":209,"depth":328,"text":212},{"id":236,"depth":328,"text":239},"markdown","content:blog:2022-in-review.md","content","blog/2022-in-review.md","md",[341,342],null,{"_path":343,"title":344},"/blog/2023-travels-visual-journey","My 2023 travels: A visual journey",1707233791486]