{"_path":"/about","_dir":"","_draft":false,"_partial":false,"_locale":"en","_empty":false,"title":"About","description":"Hey there! I'm a seasoned software engineer with a passion for technology and a Master's degree in Information Engineering. My journey in tech began in Nepal, but I've been residing in Germany for the past 5 years. With a decade of experience under my belt, I've honed my skills in several programming languages, including Javascript, NodeJS, Python, and PHP. Additionally, my expertise in team-leading and technical experience bring a unique and valuable perspective to any organization I work with.","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Hey there! I'm a seasoned software engineer with a passion for technology and a Master's degree in Information Engineering. My journey in tech began in Nepal, but I've been residing in Germany for the past 5 years. With a decade of experience under my belt, I've honed my skills in several programming languages, including Javascript, NodeJS, Python, and PHP. Additionally, my expertise in team-leading and technical experience bring a unique and valuable perspective to any organization I work with."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I have a proven track record of delivering results and finding creative solutions to complex challenges. My excellent communication skills and ability to work with a variety of individuals, including mentoring and collaborating with team members and colleagues from diverse backgrounds, have been key to my success. I believe that success comes from working together, and I excel in diverse team environments and embrace collaboration and teamwork."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"My passion for creating technologies that improve people's lives fuels my drive for continuous learning and professional growth. I am always seeking opportunities to expand my knowledge and skills and am committed to both personal and professional development."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When I'm not working, I love to explore new destinations, connect with nature, and dive into deep philosophical ideas. I have a passion for travel, hiking, and photography and am fascinated by philosophy. I also have an eye towards the future and what technology can achieve. This fascination fuels my love for science fiction and my imagination of the endless possibilities of the future and how technology can shape our world."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:about.md","_source":"content","_file":"about.md","_extension":"md"}