{"_path":"/about","_dir":"","_draft":false,"_partial":false,"_locale":"en","_empty":false,"title":"About","description":"Hey there! I'm a tech-savvy software engineer with a decade of experience and a Master's degree in Information Engineering. Originally from Nepal, I've been living in Germany for the past 5 years. My goal is to create innovative products that enhance people's lives and I'm passionate about it. With a combination of technical skills and team-leading experience, I bring a unique value to any organization I work with.","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Hey there! I'm a tech-savvy software engineer with a decade of experience and a Master's degree in Information Engineering. Originally from Nepal, I've been living in Germany for the past 5 years. My goal is to create innovative products that enhance people's lives and I'm passionate about it. With a combination of technical skills and team-leading experience, I bring a unique value to any organization I work with."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I've got a proven track record of delivering results and finding creative solutions to tough problems. Plus, I'm a great communicator and love to work with others, whether that's mentoring my team or collaborating with colleagues from different backgrounds. I'm always looking to learn and grow, both professionally and personally, and I believe that success comes from working together."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In my free time, I love to explore the world, connect with nature, and immerse myself in deep ideas. I have a love for travel, hiking, and photography, and I'm fascinated by philosophy. I also have an eye towards the future and what technology can achieve."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In addition, I have a great appreciation for science fiction. I love to imagine the possibilities of the future and how technology could shape our world. This love fuels my passion for creating cutting-edge solutions and exploring new frontiers in the tech world."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:about.md","_source":"content","_file":"about.md","_extension":"md"}