[{"data":1,"prerenderedAt":52},["Reactive",2],{"content-query-RizbiHReX6":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":5,"_empty":6,"title":7,"description":8,"body":9,"_type":47,"_id":48,"_source":49,"_file":50,"_extension":51},"/about","",false,"About","Greetings! I am an experienced software engineer with a strong passion for technology.",{"type":10,"children":11,"toc":44},"root",[12,19,24,29,34,39],{"type":13,"tag":14,"props":15,"children":16},"element","p",{},[17],{"type":18,"value":8},"text",{"type":13,"tag":14,"props":20,"children":21},{},[22],{"type":18,"value":23},"Originally from Nepal, I've been living in Germany since late 2016, where I earned a Master's degree in Information Engineering, specializing in Intelligent Systems. My continued professional journey in Germany has provided me with valuable experiences, working with diverse teams and engaging in interesting projects.",{"type":13,"tag":14,"props":25,"children":26},{},[27],{"type":18,"value":28},"Over the course of a decade in my professional career, I have honed my skills in several programming languages, including Python, Javascript, Typescript, NodeJS, and PHP. I have a successful history of getting things done and a knack for devising innovative solutions to complex challenges.",{"type":13,"tag":14,"props":30,"children":31},{},[32],{"type":18,"value":33},"I have been leading and mentoring a software engineering team, resulting in outstanding outcomes. With strong communication skills, I effectively collaborate with diverse colleagues and teams, fostering a positive and inclusive work environment. I genuinely appreciate the value of different perspectives and firmly believe in the power of teamwork for achieving success.",{"type":13,"tag":14,"props":35,"children":36},{},[37],{"type":18,"value":38},"My passion lies in creating technology that enhances people's lives. I strongly advocate for making technology accessible to all and promoting knowledge sharing. As a result, I wholeheartedly embrace the open-source software movement and actively engage with the vibrant open-source community.",{"type":13,"tag":14,"props":40,"children":41},{},[42],{"type":18,"value":43},"In my leisure time, I find joy in exploring new places, immersing myself in nature, and contemplating profound concepts. Capturing the beauty of the world through photography and videography is a passion of mine. Additionally, I have a deep affection for science fiction, as it ignites my imagination and fuels my curiosity about the potential of future technologies.",{"title":5,"searchDepth":45,"depth":45,"links":46},2,[],"markdown","content:about.md","content","about.md","md",1691927342033]